In [50]:
import pandas as pd

In [51]:
#1 Create data frame from Dictionary

dict = {"Name":['Santhosh','Anand','Sreedevi','Prashanth','Sachin'],
        "Age":[32,34,31,30,37],
        "Company":["ABB",'DELL','Tesco','Tesco','Volvo']}

df = pd.DataFrame(dict)

In [52]:
# Display the  Data Frame

df

        Name  Age Company
0   Santhosh   32     ABB
1      Anand   34    DELL
2   Sreedevi   31   Tesco
3  Prashanth   30   Tesco
4     Sachin   37   Volvo

In [53]:
# Print information about the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name       5 non-null object
Age        5 non-null int64
Company    5 non-null object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [6]:
#02 Get the Column Name

Index(['Name', 'Age', 'Company'], dtype='object')

In [7]:
# Share of the Column

df.shape  # (row,column)

(5, 3)

In [8]:
# Total Columns in the Dataframe

len(df.columns)

3

In [9]:
# print fist 5 Rows or Observation

df.head()

        Name  Age Company
0   Santhosh   32     ABB
1      Anand   34    DELL
2   Sreedevi   31   Tesco
3  Prashanth   30   Tesco
4     Sachin   37   Volvo

In [10]:
# Check Whether the Object is empty or not
df.empty

False

In [11]:
# Check number of dimensions of the object
df.ndim # Here  DataFrame is a 2D object

2

In [12]:
#  Number of elements in the DataFrame.
df.size

15

In [13]:
df['Age'].sum()

164

In [14]:
# Returns the actual data in the DataFrame as an NDarray.
df.values

array([['Santhosh', 32, 'ABB'],
       ['Anand', 34, 'DELL'],
       ['Sreedevi', 31, 'Tesco'],
       ['Prashanth', 30, 'Tesco'],
       ['Sachin', 37, 'Volvo']], dtype=object)

In [55]:
# Get Unique elemenst in the Column of DataFrame
df.Company.unique()

array(['ABB', 'DELL', 'Tesco', 'Volvo'], dtype=object)

In [15]:
# print last 5 Rows or Observation

df.tail()

        Name  Age Company
0   Santhosh   32     ABB
1      Anand   34    DELL
2   Sreedevi   31   Tesco
3  Prashanth   30   Tesco
4     Sachin   37   Volvo

In [16]:
# print only first 3 Rows or Observation

df.head(3)

       Name  Age Company
0  Santhosh   32     ABB
1     Anand   34    DELL
2  Sreedevi   31   Tesco

In [17]:
# Get only the Specific Column
df.Company

0      ABB
1     DELL
2    Tesco
3    Tesco
4    Volvo
Name: Company, dtype: object

In [18]:
# Get only the Specific Column
df['Company']

0      ABB
1     DELL
2    Tesco
3    Tesco
4    Volvo
Name: Company, dtype: object

In [19]:
# Get only the Specific Columns
df[['Name','Age']]

        Name  Age
0   Santhosh   32
1      Anand   34
2   Sreedevi   31
3  Prashanth   30
4     Sachin   37

In [20]:
# Get the Data Types of Indivisual Column
df.dtypes

Name       object
Age         int64
Company    object
dtype: object

In [57]:
# Selecting columns by data type
df.select_dtypes(include='number')

   Age
0   32
1   34
2   31
3   30
4   37

In [21]:
# Statistical Summarizing Integer Data
df.describe()

             Age
count   5.000000
mean   32.800000
std     2.774887
min    30.000000
25%    31.000000
50%    32.000000
75%    34.000000
max    37.000000

In [22]:
# Create Sample DataFrame
import numpy as np

df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})

df

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [23]:
# Rename Column

df = df.rename(columns={'col1':'Column1 ','col2':'Column2 ','col3':'Column3 ','col4':'Column4 '})

In [24]:
# Replacing spaces with underscores for all columns 

df.columns.str.replace(' ','_')

Index(['Column1_', 'Column2_', 'Column3_', 'Column4_'], dtype='object')

In [25]:
df

  Column1   Column2   Column3  Column4
0        A         2         0        a
1        A         1         1        B
2        B         9         9        c
3      NaN         8         4        D
4        D         7         2        e
5        C         4         3        F

In [26]:
# Delete Column from the DataFrame

columsn = ['Column2 ','Column4 ']

df.drop(columsn,axis=1,inplace=True)

# Check whether Columns are droped
df

  Column1   Column3
0        A         0
1        A         1
2        B         9
3      NaN         4
4        D         2
5        C         3

In [27]:
# Column Deletion using 'del' function

del df['Column1 ']

df

   Column3
0         0
1         1
2         9
3         4
4         2
5         3

In [28]:
# Column Deletion using 'pop ' function

df.pop('Column3 ')

df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

Empty DataFrame
Columns: []
Index: [0, 1, 4, 5]

In [30]:
# Adding New Column

df['Column4'] = ['a', 'B', 'c', 'D']


df

  Column4
0       a
1       B
4       c
5       D

  col1 col2
0    A    2
1    A    1
2    B    9
3  NaN    8
4    D    7
5    C    4
0    0    a
1    1    B
2    9    c
3    4    D
4    2    e
5    3    F

In [48]:
# Get only the rows where nulll values on specific column

df[df['col1'].isnull()]

  col1 col2
3  NaN    8

In [49]:

# Get the Count of Unique elements in the column
df.col1.value_counts()

A    2
3    1
C    1
1    1
9    1
D    1
4    1
2    1
0    1
B    1
Name: col1, dtype: int64

In [42]:
#1 Create data frame from Dictionary

dict = {"Name":['Santhosh','Anand','Sreedevi','Prashanth','Sachin'],
        "Age":[32,34,31,30,37],
        "Company":["ABB",'DELL','Tesco','Tesco','Volvo']}

df = pd.DataFrame(dict)

df

        Name  Age Company
0   Santhosh   32     ABB
1      Anand   34    DELL
2   Sreedevi   31   Tesco
3  Prashanth   30   Tesco
4     Sachin   37   Volvo

In [43]:
# DataFrame T (Transpose)

df.T

                0      1         2          3       4
Name     Santhosh  Anand  Sreedevi  Prashanth  Sachin
Age            32     34        31         30      37
Company       ABB   DELL     Tesco      Tesco   Volvo

In [35]:
# Concatination

# Horizontal Concatination
# Verticle Concatination

In [36]:
df

        Name  Age Company
0   Santhosh   32     ABB
1      Anand   34    DELL
2   Sreedevi   31   Tesco
3  Prashanth   30   Tesco
4     Sachin   37   Volvo

In [37]:
df

        Name  Age Company
0   Santhosh   32     ABB
1      Anand   34    DELL
2   Sreedevi   31   Tesco
3  Prashanth   30   Tesco
4     Sachin   37   Volvo

In [ ]:
'''
1. df.describe() : 
    - It help us to see or understand how the data distribution is numerically.
    - We can also check wheher all the columns on the dataframe are similar scaling or not
    
2.Reading the Tabular df
    - pd.read_csv('Titanic.csv')`
    
2.How do you select a columns df in dfFrame as Series
    - df['Pclass']
    - df.Pclsss
    
3.Check the Type of the df
    - Type(df['Pclass])

4.How to Create New Pandas Sereis in dfFrame?
    - df['Location] = df.City + ',' + df.State

5.Looking at the first 5 rows of the dfFrame
    - df.head()

6.Show descriptive statistics of numeric columns
    - df.describe()

7.Finding out dimensionality of dfFrame
    - df.shape

8.Finding out df types of each columns
    -df.types

9.Check out only the columns
    - df.columns

10.Rename a Single Column
    - df.rename(columns = {'Pclass':'P_Class','Ticket':'Ticket_No'})

11.Rename a Columns 
    - titanic_columns = ['P_clss',Ticket_no','Name_Name']
    - df.columns = titanic_columns

12.Replacing spaces with underscores for all columns 
    - titanic.columns.str.replace(' ','_')

13.Removing columns from a pandas dfFrame
    - list_drop = ['City', 'State']
    - Drop.drop(list_drop, axis=1, inplace=True)

14.Removing the Rows 0 and 1
    - rows = [0, 1]
    - df.drop(rows, axis=0, inplace=True)

15.Sort using sort_values
    #1: df.title.sort_values()
    #2: df['title'].sort_values()
    #3: movies.title.sort_values(ascending=False)
    #4: movies.sort_values('title')
    #5: movies.sort_values('duration', ascending=False)
    
16 : Sorting a dfFrame using multiple columns
    #1: columns = ['content_rating', 'duration']
        movies.sort_values(columns)

17 : #1: Filtering 
    booleans = []
    
    # loop
    for length in movies.duration:
            if length >= 200:
               booleans.append(True)
            else:
               booleans.append(False)

    # convert booleans into a Pandas series
    is_long = pd.Series(booleans)

    # this pulls out duration >= 200mins
    movies['is_long']

    #2: Filtering
    is_long = movies.duration >= 200
    movies[is_long]

    #3: Filtering
    movies[movies.duration >= 200]

    #4: Filtering
    movies[movies.duration >= 200]['genre']
    movies[movies.duration >= 200].genre

    #5: Filtering
    movies.loc[movies.duration >= 200, 'genre']

    #6 : Filter
    df.filter(['Sex','Last Name'])

18: #1: Multiple Filter :And
    movies[(movies.duration >= 200) & (movies.genre == 'Drama')]

    #2: Multiple Filter : or
    movies[(movies.duration >= 200) | (movies.genre == 'Drama')]

    #3: (movies.duration >= 200) | (movies.genre == 'Drama')
    
    #4: (movies.duration >= 200) | (movies.genre == 'Drama')

    #5: movies[(movies.genre == 'Crime') | (movies.genre == 'Drama') | (movies.genre == 'Action')]

    #6:
    filter_list = ['Crime', 'Drama', 'Action']
    movies[movies.genre.isin(filter_list)]
    
19: Reading subset of columns or rows
    #1 : # reference using String
    cols = ['City', 'State']
    ufo = pd.read_csv(link, usecols=cols)

    #2 : # if you only want certain number of rows
    ufo = pd.read_csv(link, nrows=3)

    #3 : Iterating through a Series and dfFrame
      for c in ufo.City:
       print(c)
      ******************************
      for index, row in ufo.iterrows():
          print(index, row.City, row.State)

20: Using String Methods
    orders = pd.read_table(url)
    #1 : orders.item_name.str.upper()
    #2 : orders.item_name = orders.item_name.str.upper()
    #3 : orders.item_name.str.contains('Chicken').head()
    #4 : orders.choice_description.str.replace('[', '').head()
    #5 : orders.choice_description.str.replace('[', '').str.replace(']', '').head()
    

21: Selecting Multiple Rows and Columns

    #1 :Format : df.loc[rows,column]
    #2 :df.loc[0,:]  :- Row 0 and all columns
    #3 :df.loc[[0,1,2],:]  :- rows 0,1,2 and all columns
    #4 :df.loc[0:2,:]  :- rows 0,1,2 and All columns
    #5 :df.loc[0:2] :-rows 0,1,2 and all columns
    #6 :df.loc[:,'City'] :- All rows and Column 'City'
    #7 :df.loc[:,['City','State']] :- All rows and Coumns 'City' and 'State'
    #8 :df.loc[:,'City' : 'State'] : All rows and Columns from City to State
    #9 :df.loc[0:2,'City':'State'] : Multiple rows and Columsn
    #10:df.loc[df.city == 'Banglore',:]
    #11:df.loc[ufo.City=='Oakland', 'State'] : Rows which have city value('Oakland') and column 'State'
    #12:df.iloc[:, [0, 3]]
    #13:df.iloc[:, 0:4]
    #14:df.iloc[0:3, :]
    #15:df[['City', 'State']] : # non-explicit code
    #16:df.loc[:, ['City', 'State']] : # explicit code
    #17:df.iloc[0:2, :]
    #19:df.ix['Albania', 0]
    #20:df.ix[1, 'beer_servings']
    #21:df.ix['Albania':'Andorra', 0:2]
    #22:df.ix[0:2, 0:2]

22: Handling missing values in pandas
    #1 : df.isnull().tail() :-checking which are NaN (True) using isnull
    #2 : df.notnull().tail()
    #3 : df.isnull().sum() :- count number of missing values in each column
    #4 : df[df.City.isnull()]
    #5 : df.dropna(how='any').shape
        # drop rows if any of the 5 columns have a missing value
        # how='any' is the default, you need not include this
    #6 : ufo.dropna(how='all').shape : drop row if all of the columns are missing
    #7 : ufo.dropna(subset=['City', 'Shape Reported'], how='any').shape
        # # drop row if either City or Shape Reported are missing
    #8 : ufo.dropna(subset=['City', 'Shape Reported'], how='all').shape
        # drop row if both City and Shape Reported are missing
        

23: Group By

    #1 : drinks.groupby('continent').beer_servings.mean()
    #2 : df.groupby("Sex").Pclass.mean()
    #3 : df[df.Sex=='male'].mean()
    #4 : df[df.Sex=='male'].Pclass.mean()
    #5 : df.groupby('Sex').Pclass.max()
    #6 : df.groupby('Sex').Pclass.min()
    #7 : df.groupby('Sex').Pclass.agg(['count','min','max','mean'])
    #8 : df.groupby('Sex').mean()
             # df.plot(kind='bar')
    #9 : print(df.groupby('state').groups)
    #10 : Itertaion through groups
         for name,group in states:
             print(name)
             print(group)
    #11 : # Get the Specific group
          states = df.groupby('state')
          print(states.get_group('dc'))
    #12 : 
    
    
24: Set Index
    #1 : df.set_index('Sex',inplace=True)
    #2 : df.index
    #3 : df.describe().index

26: Creating Dummy variables
    #1 : train['Sex_male'] = train.Sex.map({'female':0, 'male':1})
    #2 : pd.get_dummies(train.Sex)
    #3 : pd.get_dummies(train.Sex, prefix='Sex').iloc[:, 1:]
    #4 : pd.get_dummies(train.Sex, prefix='Sex').loc[:, 'Sex_male':]
    #5 : pd.get_dummies(train, columns=['Sex', 'Embarked'], drop_first=True)

#27: Removing duplicate rows

    #1 : users.zip_code.duplicated().sum()
    #2 : users.drop_duplicates(keep='first').shape
    #3 : users.drop_duplicates(keep='last').shape
    #4 : users.drop_duplicates(keep=False).shape
    #5 : users.duplicated(subset=['age', 'zip_code']).sum() # only consider "age" and "zip_code" as the relevant columns
    
#28: Changing display options in pandas
    #1 :import numpy as np
        import pandas as pd

    #2 : df = pd.read_csv("Titanic.csv")

    #3 : use display.max_rows
         pd.get_option('display.max_rows')

    #4 let's change to set_option to change
         pd.set_option('display.max_rows', None)

    #5 reset back to normal
        pd.reset_option('display.max_rows')

    #6 The default for columns is 20
        pd.get_option('display.max_columns')

    #7 The Default colu Width
       pd.get_option('display.max_colwidth')

    #8 You can't use none here
       pd.set_option('display.max_colwidth', 1000)

    #9 Decimal places for numbers
    pd.get_option('display.precision')

    #10 pd.set_option('display.precision', 3)

    #11 Split numbers using commas
       pd.set_option('display.float_format', '{:,}'.format)

    #12  we can convert y to float using .astype
    # Replace existing column using assignment
       drinks['wine_servings'] = drinks.wine_servings.astype(float)

    # Offline documentation
       pd.describe_option()

    # Specific searching
       pd.describe_option('rows')

    # reset all options
    pd.reset_option('all')
    
29: Creating a dfFrame from Objects

    #1 Create a dictionary
          ex_dic = {'id': [100, 101, 102],'color': ['red', 'blue', 'red']}

    #2 Create a list of strings
          columns = ['id', 'color']
          index = ['a', 'b', 'c']
          df= pd.dfFrame(ex_dic)
          df = pd.dfFrame(ex_dict, columns=columns, index=index)

    #2 List of lists
           list_of_lists = [[100, 'red'],[101, 'blue'],[102, 'red']] 
           # columns
           columns = ['id', 'color']
           pd.dfFrame(list_of_lists, columns=columns)

    #3 Create 4x2 random array # array is a list of lists
           arr = np.random.rand(4, 2)
           # columns
           columns_new = ['one', 'two']
           # pass in array and columns
           pd.dfFrame(arr, columns=columns_new)

    #4 Value: series of values
           dict_new = {'student': np.arange(100, 110, 1), 'test': np.random.randint(60, 101, 10)}
           pd.dfFrame(dict_new)
           
30 : Create dataFrame using Dictionalry
            df = pd.DataFrame({
                               'name':['john','mary','peter','jeff','bill','lisa','jose'],
                               'age':[23,78,22,19,45,33,20],
                               'gender':['M','F','M','M','M','F','M'],
                               'state':['california','dc','california','dc','california','texas','texas'],
                               'num_children':[2,0,0,3,2,1,4],
                               'num_pets':[5,1,0,5,2,2,3]
                             })
                             
30.1 : Create DataFrame using Lists

    weather=['Sunny','Sunny','Overcast','Rainy']
    temp=['Hot','Hot','Hot','Mild']
    play=['No','No','Yes','Yes']

    Data= pd.dfFrame({"Weather": weather,"Temprature":temp,"Play":play})
    

31 : Query
    Ex1: df = pd.dfFrame(np.random.randn(10,2),columns = list('ab'))
         df.query('a>b')

    Ex2:
        df = pd.read_csv("Titanic.csv")
    df.query('Age > 20 & Pclass == 3')
    df.query('Age > 20 and Pclass == 3 and SibSp == 1 and Embarked == "S"',inplace = True)
    
32 : Replace Column Space with _
    df.columns = [a.replace(" ","_") for a in df.columns]
    
33 : Where

    Ex1 :filter1 = df['Pclass'] == 3
             df.where(filter1,inplace = True)

    Ex2 :filter1 = df['Pclass'] == 3 
             filter2 = df['Sex'] == 'male'
             df.where(filter1 & filter2,inplace = True)
             

34 : Display digit values on the digit dataset 
    from sklearn.dfsets import load_digits
    import numpy as np 
    import matplotlib.pyplot as plt

    digits = load_digits()
    plt.figure(figsize=(20,4))
    for index, (image, label) in enumerate(zip(digits.df[0:5], digits.target[0:5])):
        plt.subplot=(1, 5, index + 1)
        plt.imshow(np.reshape(image, (8,8)), cmap=plt.cm.gray)
        plt.title('Training: %i\n' % label, fontsize = 20)
        
35 : Find a number of categorical features and numeric features in the dfset.
     cat_col = df.select_dtypes(include = 'object').columns.tolist()
     num_col = df.select_dtypes(exclude='object').columns.tolist()

36 : df.nunique(axis = 0, dropna = True) 

37 : df.isnull().sum().sort_values(ascending= False)

38 :le = LabelEncoder()
    df['grade'] = le.fit_transform(df['grade'])
    df['grade'].corr(df['score'])

39 :
    # we can usually interpolate the missing values, if there are any
    nasa_df.interpolate()

40 : Find any null values in the DataFrame
     df.isnull().any()

41 : Get All the columns on the Data Frame
     df.columns[:]

42 : Find the Null values on the data Frame Column wise
     df.isnull().any(axis=0)

43 : Find the null values on the data frame row wise
     df.isnull().any(axis=1)

44 : Print out Name column as pandas series
    df['Name']

45: Display dataframe Value from the Column Name
    df[['Name']]

46: Display dataframe Value  from the Column is 'Name' and 'Sex'
    df[['Name','Sex']]

47:  Display the item by soring based on Alphabets in the Name
    df.sort_values("Name")

48: Merge Two DataFrame
    
    import pandas as pd

    df1= pd.DataFrame({ "HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],"IND_GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])
    df2=pd.DataFrame({ "HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],"IND_GDP":[50,45,45,67]}, index=[2005, 2006,2007,2008])

    merged= pd.merge(df1,df2)

    print(merged)

    merged= pd.merge(df1,df2,on ="HPI")
    print(merged)


49: Join

    df1 = pd.DataFrame({"Int_Rate":[2,1,2,3], "IND_GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])

    df2 = pd.DataFrame({"Low_Tier_HPI":[50,45,67,34],"Unemployment":[1,3,5,6]}, index=[2001, 2003,2004,2004])

    joined= df1.join(df2)
    print(joined)


50: Concat

    df1 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3], "IND_GDP":[50,45,45,67]}, index=[2001, 2002,2003,2004])

    df2 = pd.DataFrame({"HPI":[80,90,70,60],"Int_Rate":[2,1,2,3],"IND_GDP":[50,45,45,67]}, index=[2005, 2006,2007,2008])

    concat= pd.concat([df1,df2])

    print(concat)
    
51: Change the Column Headers

    import pandas as pd

    df = pd.DataFrame({"Day":[1,2,3,4], "Visitors":[200, 100,230,300], "Bounce_Rate":[20,45,60,10]})

    df = df.rename(columns={"Visitors":"Users"})

    print(df)


53: Data Munging
    In Data munging, you can convert a particular data into a different format. For example, if you have a .csv file, 
    you can convert it into .html or any other data format as well. So, let me implement this practically.

54: Read HTML

    import pandas as pd

    country= pd.read_csv("D:\\Users\\Aayushi\\Downloads\\world-bank-youth-unemployment\\API_ILO_country_YU.csv",index_col=0)

    country.to_html('edu.html')

55: Iterate over through the Dataframe

    df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])

    for index,row in df.iterrows():
        print(row['A'], row['B'])

56: You can convert a numpy array to a pandas data frame with pd.Data frame(). The opposite is also possible. 
    To convert a pandas Data Frame to an array, you can use np.array()

    ## Numpy to pandas
    import numpy as np
    h = [[1,2],[3,4]] 
    df_h = pd.DataFrame(h)
    print('Data Frame:', df_h)
    
57:You can also use a dictionary to create a Pandas dataframe.

    dic = {'Name': ["John", "Smith"], 'Age': [30, 40]}
    pd.DataFrame(data=dic)

In [ ]:
'''
import numpy as np
import pandas as pd

dates_m = pd.date_range('20300101', periods=6, freq='M')
random = np.random.randn(6,4)

df = pd.DataFrame(random,index=dates_m,columns=list('ABCD'))

df

df.head(3)

df.tail(3)

df.describe()

# Slice data

df['A']

## The loc function is used to select columns by names
df[['A', 'B']]

### using a slice for row
df[0:3]

## Multi col
df.loc[:,['A','B']]

# You can use iloc[]. This method uses the index instead of the columns name
df.iloc[:, :2]

# You can drop columns using pd.drop()
df.drop(columns=['A', 'C'])

In [ ]:
'''

import numpy as np
import pandas as pd

# Concatenation
# You can concatenate two DataFrame in Pandas. You can use pd.concat()

df1 = pd.DataFrame({'name': ['John', 'Smith','Paul'],
                     'Age': ['25', '30', '50']},
                    index=[0, 1, 2])
df2 = pd.DataFrame({'name': ['Adam', 'Smith' ],
                     'Age': ['26', '11']},
                    index=[3, 4])

df_concat = pd.concat([df1,df2]) 
df_concat

In [ ]:
'''

# Drop_duplicates
df_concat.drop_duplicates('name')

# Rename: change of index
df_concat.rename(columns={"name": "Surname", "Age": "Age_ppl"})

In [ ]:
'''
import numpy as np
import pandas as pd

# Aggregation (Sum,Count,Max,min,Median)

df = pd.read_csv('nba.csv')

# printing the first 10 rows of the dataframe 
df[:10]

df.aggregate(['sum', 'min']) 

# We are going to find aggregation for these columns 
#df.aggregate({"Number":['sum', 'min'], 
#              "Age":['max', 'min'], 
#              "Weight":['min', 'sum'],  
#              "Salary":['sum']})

In [ ]:
'''

df = pd.DataFrame({"A":[12, 4, 5, 44, 1], 
                   "B":[5, 2, 54, 3, 2], 
                   "C":[20, 16, 7, 3, 8],  
                   "D":[14, 3, 17, 2, 6]}) 

# Even if we do not specify axis = 0,  
# the method will return the max over 
# the index axis by default 
df.max(axis = 0)

In [ ]:
'''

df = pd.DataFrame({"A":[12, 4, 5, None, 1],  
                   "B":[7, 2, 54, 3, None], 
                   "C":[20, 16, 11, 3, 8], 
                   "D":[14, 3, None, 2, 6]})

# skip the Na values while finding the maximum 
df.max(axis = 1, skipna = True)

In [ ]:
'''
Different Ways to Filter A Pandas DataFrame

1. View only specific Columns
    df['Name']

2. Filter Row Where
    df[df['year'] > 2012]

3. Filter First/Last Rows
    First Row : df[:2]
    Last Row : df[-1:]

4. Query String 
    df.query('year > 2012 | name == "Frank"')

5. Where Value Is In Specified List
    numbers = [4, 2]
    df[df['reports'].isin(numbers)]

6. Where Value Is/Not null(NaN)
    df[df['year'].notnull()]
    
    df[df['year'].isnull()]

7. using loc FUnction
    newdf = df.loc[(df.origin == "JFK") & (df.carrier == "B6")]

8. Filter Pandas Dataframe by Row and Column Position(iloc)
    df.iloc[:5,] #First 5 rows
    df.iloc[1:5,] #Second to Fifth row
    df.iloc[5,0] #Sixth row and 1st column
    df.iloc[1:5,0] #Second to Fifth row, first column
    df.iloc[1:5,:5] #Second to Fifth row, first 5 columns
    df.iloc[2:7,1:3] #Third to Seventh row, 2nd and 3rd column

9. Selecting multiple values of a column
    newdf = df[df.origin.isin(["JFK", "LGA"])]

10. How to negate the whole condition
    newdf = df[~((df.origin == "JFK") & (df.carrier == "B6"))]

11. Select Rows of Pandas Dataframe Based on a Single Value of a Column
    df[df['year] == 2002]

12. Filter rows using Pandas chaining
    df[df.year.eq(2002)]
    df[df.year.less(2002)]
    df[df.year.greater(2002)]

13. Select Rows of Pandas Dataframe Whose Column Value Does NOT Equal a Specific Value?
    df[df['year']!=2002]

14. Select Rows of Pandas Dataframe Whose Column Value is NOT NA/NAN?
    df[df.year.notnull()]

15. Select Rows of Pandas Dataframe Based on a list?
    years = [1952, 2007]
    df.year.isin(years)

16. Select Rows of Pandas Dataframe Based on Values NOT in a list?
    continents = ['Asia','Africa', 'Americas', 'Europe']
    df[~df.continent.isin(continents)]

17.  Select Rows of Pandas Dataframe using Multiple Conditions?
    df[~df.continent.isin(continents) & df.year.isin(years)]